doc: more feature
